In [1]:
#1.Write a Python program to add, subtract, multiply and divide two Pandas Series.
#Input: [2, 4, 6, 8, 10], [1, 3, 5, 7, 9]

In [1]:
import numpy as np
import pandas as pd

In [3]:
a = np.array([2,4,6,8,10])

In [4]:
a

array([ 2,  4,  6,  8, 10])

In [48]:
list(string.ascii_lowercase[:5])

['a', 'b', 'c', 'd', 'e']

In [49]:
import string
a = pd.Series([2,4,6,8,10])

b = pd.Series([1,3,5,7,9])

In [50]:
a

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [51]:
a

0     2
1     4
2     6
3     8
4    10
dtype: int64

In [52]:
print(a+b)
print(a-b)
print(a*b)
print(a/b)

0     3
1     7
2    11
3    15
4    19
dtype: int64
0    1
1    1
2    1
3    1
4    1
dtype: int64
0     2
1    12
2    30
3    56
4    90
dtype: int64
0    2.000000
1    1.333333
2    1.200000
3    1.142857
4    1.111111
dtype: float64

In [53]:
#2. Write a Python program to convert a dictionary to a Pandas series

In [55]:
d1 = {'a': 100, 'b': 200, 'c': 300, 'd': 400, 'e': 800}
pd.Series(d1)

a    100
b    200
c    300
d    400
e    800
dtype: int64

In [56]:
pd.Series({'a': 100, 'b': 200, 'c': 300, 'd': 400, 'e': 800})

a    100
b    200
c    300
d    400
e    800
dtype: int64

In [ ]:
#3. Write a Python program to change the data type of given a column or a Series: convert to float64
# Original Data Series:
# 0 100
# 1 200
# 2 python
# 3 300.12
# 4 400

In [3]:
a=pd.Series([100,200,'python',300.12,400])

In [4]:
a

0       100
1       200
2    python
3    300.12
4       400
dtype: object

In [5]:
type(a)

pandas.core.series.Series

In [6]:
a.dtype

dtype('O')

In [67]:
a.astype('float64',errors='ignore')     #ignoring the error: not converting the other values

0       100
1       200
2    python
3    300.12
4       400
dtype: object

In [7]:
a.astype('float64',errors='coerce')  #not allowed

ValueError: Expected value of kwarg 'errors' to be one of ['raise', 'ignore']. Supplied value is 'coerce'

In [8]:
x = pd.Series([100,200,300,400,800])
print(x)
x.astype('float')

0    100
1    200
2    300
3    400
4    800
dtype: int64

0    100.0
1    200.0
2    300.0
3    400.0
4    800.0
dtype: float64

In [9]:
pd.to_numeric(a, errors='coerce')   #coerce: forcefully change something

0    100.00
1    200.00
2       NaN
3    300.12
4    400.00
dtype: float64

In [10]:
a

0       100
1       200
2    python
3    300.12
4       400
dtype: object

In [11]:
a[3] = 300

In [12]:
a

0       100
1       200
2    python
3       300
4       400
dtype: object

In [13]:
pd.to_numeric(a,errors='coerce')

0    100.0
1    200.0
2      NaN
3    300.0
4    400.0
dtype: float64

In [76]:
pd.Series([1,2,3, np.nan, 5,6])   #int+nan: float

0    1.0
1    2.0
2    3.0
3    NaN
4    5.0
5    6.0
dtype: float64

In [77]:
b = pd.Series(['1','2','3','4'])
pd.to_numeric(b)

0    1
1    2
2    3
3    4
dtype: int64

In [79]:
 pd.Series(['a','b','c','d', np.nan])   #string+nan: object

0      a
1      b
2      c
3      d
4    NaN
dtype: object

In [80]:
#Write a Pandas program to create a subset of a given series based on value and condition.

In [ ]:
# Original Data Series:
# 0      0
# 1      1
# 2      2
# 3      3
# 4      4
# 5      5
# 6      6
# 7      7
# 8      8
# 9      9
# 10    10
# dtype: int64
#input: enter the value below which you would want all the numbers? 6
#output:
# Subset of the above Data Series:
# 0    0
# 1    1
# 2    2
# 3    3
# 4    4
# 5    5
# dtype: int64

In [81]:
s1= pd.Series([0,1,2,3,4,5,6,7,8,9,10])

In [84]:
s = pd.Series([0,1,2,3,4,5,6,7,8,9,10])
n=int(input("enter the value below which you would want all the numbers? "))
s[s<n]

enter the value below which you would want all the numbers? 5

0    0
1    1
2    2
3    3
4    4
dtype: int64

# Pandas

In [85]:
#1. Write a Pandas program to create and display a DataFrame from a specified dictionary data which has the index labels

In [14]:
exam_data  = {'name': ['Anastasia', 'Dima', 'Katherine', 'James', 'Emily', 'Michael', 'Matthew', 'Laura', 'Kevin', 'Jonas'],
        'score': [12.5, 9, 16.5, np.nan, 9, 20, 14.5, np.nan, 8, 19],
        'attempts': [1, 3, 2, 3, 2, 3, 1, 1, 2, 1],
        'qualify': ['yes', 'no', 'yes', 'no', 'no', 'yes', 'yes', 'no', 'no', 'yes']}
labels = ['a', 'b', 'c', 'd', 'e', 'f', 'g', 'h', 'i', 'j']

In [16]:
df = pd.DataFrame(exam_data,index=labels)
df

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes
d      James    NaN         3      no
e      Emily    9.0         2      no
f    Michael   20.0         3     yes
g    Matthew   14.5         1     yes
h      Laura    NaN         1      no
i      Kevin    8.0         2      no
j      Jonas   19.0         1     yes

In [17]:
#2.Write a Pandas program to display a summary of the basic information about a specified DataFrame and its data.

In [18]:
print(df.info())

<class 'pandas.core.frame.DataFrame'>
Index: 10 entries, a to j
Data columns (total 4 columns):
name        10 non-null object
score       8 non-null float64
attempts    10 non-null int64
qualify     10 non-null object
dtypes: float64(1), int64(1), object(2)
memory usage: 400.0+ bytes
None

In [19]:
print(df.describe(include= 'all'))

           name      score   attempts qualify
count        10   8.000000  10.000000      10
unique       10        NaN        NaN       2
top     Matthew        NaN        NaN     yes
freq          1        NaN        NaN       5
mean        NaN  13.562500   1.900000     NaN
std         NaN   4.693746   0.875595     NaN
min         NaN   8.000000   1.000000     NaN
25%         NaN   9.000000   1.000000     NaN
50%         NaN  13.500000   2.000000     NaN
75%         NaN  17.125000   2.750000     NaN
max         NaN  20.000000   3.000000     NaN

In [20]:
#3.Write a Pandas program to get the first 3 rows of a given DataFrame

In [21]:
df.head(3)

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [22]:
df[0:3]

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [23]:
df.iloc[:3]

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [24]:
df.loc['a':'c']

        name  score  attempts qualify
a  Anastasia   12.5         1     yes
b       Dima    9.0         3      no
c  Katherine   16.5         2     yes

In [25]:
# 4.Write a Pandas program to select the 'name' and 'score' columns from the following DataFrame.

In [26]:
df.iloc[:,0:2]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

In [27]:
df[['name','score']]

        name  score
a  Anastasia   12.5
b       Dima    9.0
c  Katherine   16.5
d      James    NaN
e      Emily    9.0
f    Michael   20.0
g    Matthew   14.5
h      Laura    NaN
i      Kevin    8.0
j      Jonas   19.0

In [95]:
#5. Write a Pandas program to select the rows where the number of attempts in the examination is greater than 2

In [106]:
df[df['attempts']>2]

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes

In [107]:
df.loc[df.attempts>2]

      name  score  attempts qualify
b     Dima    9.0         3      no
d    James    NaN         3      no
f  Michael   20.0         3     yes